app/controllers/members_controller.rb

  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("first_name", "last_name", "email", "mobile_phone", "created_at", "updated_at", "avatar_id", "avatar_filename", "avatar_content_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @member.update(member_params)
---
UPDATE "members" SET "avatar_id" = ?, "avatar_filename" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["avatar_id", "0c1bf8478d1e534b86092483af367aca9ff15424f239aaa2998cd5872beb"], ["avatar_filename", "profile.png"], ["updated_at", "2018-04-19 09:10:36.960073"], ["id", 1]]

  def destroy
    @member.destroy
---
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 3]]