app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "created_at", "updated_at", "posted_image_id", "posted_image_filename", "posted_image_content_type") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save